---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.Clear
source: html/2464d463-0497-5399-217d-31c4b32cd963.htm
---
# Autodesk.Revit.DB.CategorySet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```